Documents/ПеремещениеМеждуМОДИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПеремещениеМеждуМОДИСМП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПеремещениеМеждуМОДИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительОбъект</Name>
					<Comment>Используется для указания МОД между ИП</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МестоОсуществленияДеятельностиИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительАдресСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительКодФИАС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Comment>Используется для указания филиалов/подразделений одного юр.лица</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникПеремещенияМеждуМОД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательОбъект</Name>
					<Comment>Используется для указания МОД между ИП</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МестоОсуществленияДеятельностиИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательАдресСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательКодФИАС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Comment>Используется для указания филиалов/подразделений одного юр.лица</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникПеремещенияМеждуМОД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПеревозочногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеревозочногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭлектронногоПеревозочногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТранспортныеСредстваИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШтрихкодыУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РазрешениеНаОтгрузкуИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РазрешениеНаОтгрузкуИСМП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеРазрешениеНаОтгрузкуИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящийЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтменыРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПеремещениеМеждуМОДИСМП/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть") Тогда
		Товары.Очистить();
		ШтрихкодыУпаковок.Очистить();
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Ссылка", Документы.РазрешениеНаОтгрузкуИСМП.ПустаяСсылка());
	
	ВидПродукцииПиво = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДоступныеВидыПродукции(СтруктураПараметров);
	
	Если ВидПродукцииПиво.Количество() Тогда
		ТоварнаяГруппаПиво = КонструкторИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаПоВидуПродукции(ВидПродукцииПиво[0]);
	Иначе
		ТоварнаяГруппаПиво = Неопределено;
	КонецЕсли;
	
	ТоварнаяГруппа                   = ?(ЗначениеЗаполнено(ТоварнаяГруппа), ТоварнаяГруппа, ТоварнаяГруппаПиво);
	ЭтоИндивидуальныйПредприниматель = ОбщегоНазначенияИСВызовСервера.ПартнерЭтоИндивидуальныйПредприниматель(Организация);
	
	ПараметрыУказанияДанныхПоМОДВЭлектронномДокументе = ЭлектронноеВзаимодействиеИСМП.ПараметрыУказанияДанныхПоМОДВЭлектронномДокументеУПД_5_02(ТоварнаяГруппа, Дата);
	ЭтоИндивидуальныйПредприниматель                  = ОбщегоНазначенияИСВызовСервера.ПартнерОрганизацияЭтоИндивидуальныйПредприниматель(Организация);
	
	ПараметрыУказанияМОД = ПараметрыУказанияДанныхПоМОДВЭлектронномДокументе.ПараметрыУказанияМОДПоВидамПродукции.Получить(ТоварнаяГруппа);
	
	Если Не ПараметрыУказанияМОД = Неопределено Тогда
		
		ТребуетсяУказаниеФИАСГрузоотправителя = ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДОтправителя
			И ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДОтправителяИндивидуальныхПредпринимателей
			И ЭтоИндивидуальныйПредприниматель
			
			Или ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДОтправителя
			И ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДОтправителяЮридическихЛиц
			И Не ЭтоИндивидуальныйПредприниматель;
			
		ТребуетсяУказаниеФИАСГрузополучателя = ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДПолучателя
			И ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДПолучателяИндивидуальныхПредпринимателей
			И ЭтоИндивидуальныйПредприниматель
			
			Или ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДПолучателя
			И ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДПолучателяЮридическихЛиц
			И Не ЭтоИндивидуальныйПредприниматель;
		
		Если Не ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДПолучателя
			Или Не ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДПолучателяЮридическихЛиц
			Или ЭтоИндивидуальныйПредприниматель Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("Получатель");
			
		КонецЕсли;
		
		Если Не ТребуетсяУказаниеФИАСГрузополучателя Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ПолучательАдрес");
			МассивНепроверяемыхРеквизитов.Добавить("ПолучательКодФИАС");
			
		КонецЕсли;
		
		Если Не ТребуетсяУказаниеФИАСГрузоотправителя Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ОтправительАдрес");
			МассивНепроверяемыхРеквизитов.Добавить("ОтправительКодФИАС");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыУказанияДанныхПоМОДВЭлектронномДокументе.ТребуетсяУказаниеПеревозочныхДокументов
		И Не ЗначениеЗаполнено(ИдентификаторЭлектронногоПеревозочногоДокумента)
		И Не ЗначениеЗаполнено(ИдентификаторЭлектронногоПеревозочногоДокумента)
		И Не (ЗначениеЗаполнено(НомерПеревозочногоДокумента) И ЗначениеЗаполнено(ДатаПеревозочногоДокумента)) Тогда
			
		ТекстОшибки = НСтр("ru = 'Укажите данные ТТН или электронного перевозочного документа.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,
			ЭтотОбъект,
			"ИдентификаторЭлектронногоПеревозочногоДокумента",,
			Отказ);
		
	КонецЕсли;
	
	ТекущееСостояние      = РегистрыСведений.СтатусыДокументовИСМП.ТекущееСостояние(Ссылка);
	СтатусыДанныеПереданы = Документы.ПеремещениеМеждуМОДИСМП.СтатусыДанныеПереданы();
	
	Если СтатусыДанныеПереданы.Найти(ТекущееСостояние.Статус) <> Неопределено Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТоварнаяГруппа");
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиИСМП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование           = Неопределено;
	НомерПеревозочногоДокумента = "";
	ДатаПеревозочногоДокумента  = Дата(1, 1, 1);
	НомерТранспортногоСредства  = "";
	ИдентификаторЗаявки         = "";
	ИдентификаторРазрешения     = "";
	
	ШтрихкодыУпаковок.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеИСМП.ДанныеЗаполненияПеремещениеМеждуМОД_ИСМП(Организация);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

// Заполнить коды ФИАС по переданному документу по адресам отправителя и получателя.
// 
Процедура ЗаполнитьКодыФИАСПоАдресамОтправителяПолучателя() Экспорт
	
	Если ЗначениеЗаполнено(ОтправительАдрес) Тогда
		
		ОтправительКодФИАС =
			ОбщегоНазначенияИСМП.ИдентификаторФИАСПоДаннымАдреса(ОтправительАдрес).Идентификатор;
		ЭлектронноеВзаимодействиеИСМП.ВыполнитьУточнениеКодаФИАСПоМОДам(ОтправительКодФИАС, ОтправительАдресСтрокой);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолучательАдрес) Тогда
		
		ПолучательКодФИАС =
			ОбщегоНазначенияИСМП.ИдентификаторФИАСПоДаннымАдреса(ПолучательАдрес).Идентификатор;
		ЭлектронноеВзаимодействиеИСМП.ВыполнитьУточнениеКодаФИАСПоМОДам(ПолучательКодФИАС, ПолучательАдресСтрокой);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
